import React, { useState, useEffect } from "react";
import { SafeAreaView, StyleSheet, Text, View, ScrollView } from "react-native";

import { Button } from "react-native-paper";
import EmergencyButton from "./EmergencyButton";
import ReportButton from "./ReportButton";

export default function ViolenceTypes({ navigation }) {
  return (
    <SafeAreaView style={styles.container}>
      <ScrollView>
        <Text style={styles.headerContainer}>סימני אלימות</Text>
        <Text style={styles.warnings}>
          המידע באפליקציה נאסף ממקורות המפורטים מטה השימוש במידע באחריותך בלבד
        </Text>
        <View style={{ backgroundColor: "red" }}>
          <Text style={styles.headline}>אלימות כללית</Text>
          <Text style={{ color: "white", marginHorizontal: 5, fontSize: 22 }}>
            אלימות במשפחה לעיתים מתקיימת האלימות מחוץ לגבולות המשפחה ומופעלת
            כנגד נשים רק משום שהן נשים או שהנשים הן הנפגעות העיקריות ממנה באופן
            מובחן ולכן היא נקראת "אלימות מגדרית" או "אלימות נגד נשים" אנשים רבים
            אינם מודעים לכך שהם מתנהגים באלימות, מבחינתם כל עוד לא השתמשו
            באלימות פיזית או מעבר לכך הם לא נהגו באלימות, זה כמובן לא נכון
            אלימות היא לא רק פגיעה גופנית, פיזית או מילולית. אלימות היא כל פגיעה
            מכוונת בזולת בגוף ובנפש. אלימות במשפחה היא התנהגות פוגענית שמטרתה
            לשלוט ולפגוע בדרכים שונות. ולא בהכרח מי שנוהג באלימות בבית יהיה אלים
            גם מחוץ לבית. האלימות מופיעה באופנים רבים, בזמנים שונים וברמות שונות
            של עוצמה. היא קיימת בכל רובדי החברה ובכל המגזרים, השכלה, מעמד כלכלי
            חברתי או השתייכות דתית לא מהווים הגנה מפניה. האלימות לא חייבת להופיע
            יום יום, לעיתים היא תשנה צוה או תופיע יותא מצורה אחת, אך תמיד תהיה
            דינמיקה זהה: לפגוע על מנת להחליש, על מנת לשלוט.
          </Text>
          <Text style={styles.attention}>
            אלימות בכל צורה שהיא אינה מקובלת ולא לגיטימית בשום מצב והיא עלולה
            להחמיר ולגלוש לאלימות פיזית! אם אינך חובה אלימות זו אין זו אשמתך ויש
            צורך בטיפול מיידי !!
          </Text>
        </View>
        <View style={{ backgroundColor: "red" }}>
          <Text style={styles.headline}>אלימות פיזית</Text>
          <Text style={{ color: "white", marginHorizontal: 5, fontSize: 22 }}>
            האם מישהו מבני ביתך פוגע בך באופן פיזי, מכה אותך או מפעיל נגדך כוח
            גופני בכל צורה שהיא? כל התנהגות כוחנית המבוצעת כלפי מי מבני ובנות
            הבית אשר מתבטאת בפגיעה בגוף ובבריאות היא אלימות פיזית. אלימות מסוג
            זה היא מסוכנת ביותר מכיוון שהיא עלולה לעלות בחיי אדם בטווח המיידי,
            ועל כן מחייבת טיפול מהיר.
            {"\n"}
            כיצד אלימות פיזית באה לידי ביטוי? אלימות פיזית באה לידי ביטוי בפגיעה
            בגופה של אישה באמצעות הכוללת כל התנהגות המפעילה כוח פיזי כנגדה כמו
            מכות, דחיפות, יריקות, חניקות, צביטות, משיכת שיער, בעיטות, שימוש
            בנשק, גרימת כוויות, הכאה, הגבלת חופש התנועה, ולעיתים באמצעות באמצעות
            חפצים שונים כולל נשק, הטרדה, פגיעה ברכוש, פגיעה בבעלי חיים, כפיית
            ביצוע פעולות משפילות. הפגיעות גורמות לנזקים מידיים ומתמשכים, לנכות
            ואף למוות!
          </Text>
          <Text style={styles.attention}>
            אלימות פיזית אינה מקובלת ולא לגיטימית בשום מצב ובשום צורה, אם אינך
            חובה אלימות זו אין זו אשמתך ויש צורך בטיפול מיידי !!
          </Text>
        </View>
        <View style={{ backgroundColor: "red" }}>
          <Text style={styles.headline}>אלימות טכנולוגית</Text>
          <Text style={{ color: "white", marginHorizontal: 5, fontSize: 22 }}>
            נעשית בצורה מתוחכמת שאינה מותירה "עקבות". שליטה וניצול הטכנולוגיה
            בידי הגבר בכדי לשלוט על האישה, התקנת מכשירי האזנה, מערכות מיקום
            ואיתור גלובאליות (GPS), לקיחת טלפון נייד, מניעת שימוש ביישומים
            ניידים (אפליקציות), קבוצות וואטסאפ/מייל/SMS/משפחתיות/חברתיות ורשתות
            חברתיות שונות ההופכות לכלים אפקטיביים להתעללות כאשר הגבר לא מרשה
            לאישה להירשם לרשתות חברתיות שבהן היא עשויה להכיר אנשים אחרים ועוד.
          </Text>
          <Text style={styles.attention}>
            אלימות כלכלית אינה מקובלת ולא לגיטימית בשום מצב ובשום צורה והיא
            עלולה להחמיר ולגלוש לאלימות פיזית! אם אינך חובה אלימות זו אין זו
            אשמתך ויש צורך בטיפול מיידי !!
          </Text>
        </View>
        <View style={{ backgroundColor: "red" }}>
          <Text style={styles.headline}>אלימות מינית</Text>
          <Text style={{ color: "white", marginHorizontal: 5, fontSize: 22 }}>
            האם מישהו מבני ביתך פוגע בך באופן מיני, נוגע בחלקי גופך באופן לא
            רצוי או כופה את עצמו על גופך כנגד רצונך? התייחסות אל אישה כאל
            אובייקט מיני, ביצוע מעשים מגונים, קיום יחסי מין באיום, בסחיטה,
            בכפייה ובאלימות בניגוד לרצונה של האישה, או בזמנים/מצבים המסכנים את
            בריאותה. כל התנהגות מינית אלימה או שנעשית בכפייה מבלי שהצד השני
            ביקש, הסכים או רצה בכך היא אלימות מינית, לאלימות מינית השלכות
            בריאותיות ונפשיות והיא מחייבת התערבות מיידית כיצד אלימות מינית באה
            לידי ביטוי? אלימות מינית כוללת כל התנהגות בעלת אופי מיני המתבצעת
            כנגד רצונך כולל נגיעות בלתי רצויות בחלקי הגוף, פעילות מינית המלווה
            בפגיעות פיזיות, פעילות מינית עם אדם שלישי בניגוד לרצון ותוך שימוש
            בכוח פיזי או איומים, פגיעה בחזה או באיבר המין, אונס, ניסיון לאונס,
            מעשה מגונה, מעשה סדום, שימוש בילדים לצורכי פורנוגרפיה או זנות. שימו
            לב כי עבירות מין מתבצעות גם ללא שימוש בכוח כמו במקרים של גילוי עריות
            ומעשים מגונים.
            {"\n"}
            התנהגויות נוספות המהוות אלימות מינית: שימוש בכינויי גנאי מיניים,
            הפחדות במהלך קיום יחסי מין, התעקשות על התנהגויות מיניות בלתי רצויות
            על ידי הקורבן, הסתרה של קיומה של מחלת מין או אי הגנה מפניה, איסור
            שימוש באמצעי מניעה.
          </Text>
          <Text style={styles.attention}>
            אלימות מינית אינה מקובלת ולא לגיטימית בשום מצב ובשום צורה, אם אינך
            חובה אלימות זו אין זו אשמתך ויש צורך בטיפול מיידי !!
          </Text>
        </View>
        <View style={{ backgroundColor: "red" }}>
          <Text style={styles.headline}>אלימות מילולית ו\או נפשית</Text>
          <Text style={{ color: "white", marginHorizontal: 5, fontSize: 22 }}>
            האם מישהו משפיל אותך, מרים את קולו או מאיים על חייך? האם מישהו מבודד
            אותך מהסביבה ומונע ממך קשרים חברתיים? האם הוא מפגין קנאה ונוטה
            להתפרצויות זעם ? שימוש בביטויים פוגעים ומשפילים כלפי האישה הוא
            אלימות מילולית. מעבר להשלכות הנפשיות שלה, אלימות מילולית עלולה להפוך
            בכל שלב גם לאלימות פיזית, ולכן היא מחייבת התערבות וטיפול לפני שתחמיר
            שימוש באמצעים המכוונים לגרום לפגיעה רגשית ונפשית במי מבני ובנות
            הבית, ללא מגע ישיר עם גופו, הוא אלימות רגשית. מדובר למעשה בהרס שיטתי
            של תחושת הערך העצמי על ידי הפעלת כוח ושליטה בצורות שונות. אלימות
            רגשית היא אלימות שקשה לזיהוי ולכן מסוכנת ביותר, מכיוון שהתוצאות שלה
            עלולות להיות הרסניות כיצד אלימות זו באה לידי ביטוי? אלימות זו
            מאופיינת באלימות מילולית ובאה ליידי ביטוי בהפחדה ואיומים, השפלות,
            שליטה, סחיטה, הפחדות, הפגנת שליטה מוחלטת, זלזול, האשמות, קנאה,
            איסורים, דיכוי חברתי שליטה והצרת צעדים בידוד חברתי, בגינוי ובביקורת
            לגבי התנהגות האישה, פגיעה בדימוי העצמי, בחופש שלה, באמונה שלה בעצמה
            ובכוחותיה, ביכולותיה, תפקודה כאם ובריאותה הנפשית. (לאלימות נפשית
            יכולת לכלול אלימות כלכלית).
          </Text>
          <Text style={styles.attention}>
            אלימות נפשית , מילולית אינה מקובלת ולא לגיטימית בשום מצב ובשום צורה
            והיא עלולה להחמיר ולגלוש לאלימות פיזית! אם אינך חובה אלימות זו אין
            זו אשמתך ויש צורך בטיפול מיידי !!
          </Text>
        </View>
        <View style={{ backgroundColor: "red" }}>
          <Text style={styles.headline}>אלימות כלכלית</Text>
          <Text style={{ color: "white", marginHorizontal: 5, fontSize: 22 }}>
            האם מישהו מונע ממך גישה לחשבון הבנק המשותף? האם נדרשת ממך הצדקה לכל
            הוצאה או שנמנעת ממך האפשרות להתפרנס? כל ניסיון להפוך אותך ואת בני
            הבית לתלוי בפוגע לצורך קיומו החומרי והכלכלי הוא אלימות כלכלית.
            אלימות זו מונעת אפשרות לעצמאות ומעניקה שליטה מוחלטת לפוגע, ועל כן
            מחייבת התערבות וסיוע. כיצה אלימות זו באה לידי ביטוי? אלימות זו כוללת
            אמצעי שליטה של הפוגע בתחום הכלכלי כמו מניעת קבלת החלטות כלכליות,
            דרישת הצדקה לכל הוצאה לגיטימית, האשמות לא מוצדקות בבעיות כספיות,
            מניעת ושליטה על מידע בנושאים כספיים וגישה למידע ולהכנסות המשפחה,
            איסור ומניעת יציאה של האישה לעבוד או שליטה על משכורתה, מניעת גישה
            למשאבים כספיים וצרכים בסיסיים כגון: כסף, מזון, תרופות או ביגוד, ,
            שליטה על חשבונות הבנק, הקצבת כסף על פי ראות עיניו של הפוגע אלימות
            כלכלית שבה גבר הוא היחיד שיש לו שליטה על ההוצאות, והוא משתמש בכוח זה
            כנגד האישה אף על פי שגם היא תורמת מהכנסותיה  היא לא מורשית לקנות
            דברים באופן עצמאי.
          </Text>
          <Text style={styles.attention}>
            אלימות כלכלית אינה מקובלת ולא לגיטימית בשום מצב ובשום צורה והיא
            עלולה להחמיר ולגלוש לאלימות פיזית! אם אינך חובה אלימות זו אין זו
            אשמתך ויש צורך בטיפול מיידי !!
          </Text>
        </View>
        <Button
          icon="pan_tool"
          mode="contained"
          onPress={() => {
            navigation.navigate("HomePage");
          }}
          style={{ backgroundColor: "blue" }}
        >
          חזרה למסך הבית
        </Button>
      </ScrollView>
      <EmergencyButton />
      <ReportButton />
    </SafeAreaView>
  );
}

const styles = StyleSheet.create({
  container: {
    flex: 1,
    width: "100%",
    height: "100%",
  },
  warnings: {
    color: "black",
    fontSize: 20,
    textAlign: "center",
    marginHorizontal: 20,
    elevation: 1,
    fontWeight: "bold",
  },
  headerContainer: {
    backgroundColor: "#8c6cce",
    color: "yellow",
    fontSize: 35,
    textAlign: "center",
    marginHorizontal: 20,
    elevation: 1,
  },
  headline: {
    backgroundColor: "#8c6cce",
    color: "yellow",
    fontSize: 24,
    textAlign: "left",
    marginHorizontal: 5,
    elevation: 1,
  },
  attention: {
    color: "red",
    fontSize: 10,
    textAlign: "center",
    marginHorizontal: 5,
    elevation: 1,
    fontWeight: "bold",
  },
});
